haskell/gigasecond/index.html
<!DOCTYPE html>
<html>
<head>
<title>Exercism.io → Haskell → Gigasecond</title>
<!-- 2015-05-25 Mon 00:24 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Eric Bailey">
<meta  name="description" content="My solutions to Excercism.io in Haskell."
>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/css/bootstrap.min.css">
<link rel="stylesheet" type="text/css" href="../../css/style.min.css">


</head>
<body>
<div id="content">
<h1 class="title">Exercism.io → Haskell → Gigasecond</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Gigasecond</a>
<ul>
<li><a href="#sec-1-1">Source</a></li>
<li><a href="#sec-1-2">Solution</a></li>
<li><a href="#sec-1-3">Tests</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Gigasecond</h2>
<div class="outline-text-2" id="text-1">
<p>
Write a program that will calculate the date that someone turned or will celebrate their 1 Gs anniversary.
</p>

<p>
A gigasecond is one billion (\(10^9\)) seconds.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Source</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Chapter 9 in Chris Pine's online Learn to Program tutorial. <a href="http://pine.fm/LearnToProgram/?Chapter=09">view source</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Solution</h3>
<div class="outline-text-3" id="text-1-2">
<p>
First, I imported the type, <code>UTCTime</code>, and function, <code>addUTCTime</code>,
from <code>Data.Time.Clock</code>.
</p>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #F92672;">import</span> <span style="color: #66D9EF;">Data.Time.Clock</span> (<span style="color: #66D9EF;">UTCTime</span><span style="color: #FD971F;">,</span> addUTCTime)
</pre>
</div>

<p>
Then the task at hand is as simple as adding <code>1000000000</code> seconds to a given
<code>UTCTime</code>.
</p>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">fromDay</span> <span style="color: #A6E22E;">::</span> <span style="color: #66D9EF;">UTCTime</span> <span style="color: #FD971F;">-&gt;</span> <span style="color: #66D9EF;">UTCTime</span>
<span style="color: #A6E22E;">fromDay</span> <span style="color: #A6E22E;">=</span> addUTCTime 1000000000
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Tests</h3>
<div class="outline-text-3" id="text-1-3">
<p>
I added my birthday (in UTC) to <code>gigasecondTests</code>.
</p>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #75715E;">-- </span><span style="color: #75715E;">Note: This is psuedocode.</span>
gigasecondTests <span style="color: #A6E22E;">++</span>
  [ testCase <span style="color: #E6DB74;">"from feb 8 1989"</span> <span style="color: #FD971F;">$</span>
    dt <span style="color: #E6DB74;">"2020-10-18T04:21:40Z"</span> <span style="color: #FD971F;">@=?</span> fromDay (dt <span style="color: #E6DB74;">"1989-02-09T02:35:00Z"</span>) ]
</pre>
</div>

<div class="org-src-container">

<pre class="src src-fish">runhaskell gigasecond_test.hs
</pre>
</div>
<pre class="example">
Cases: 4  Tried: 4  Errors: 0  Failures: 0
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
